import { containerStyle, imageSectionStyle, imgStyle, textSectionStyle } from "../Style";

export function About() {
    
    return <>
      <div style={containerStyle}>
                <div style={textSectionStyle}>
    <p>
        <br /><br /><br />
        ברוכים הבאים לחנות המובילה בישראל לכלי נגינה ולמערכות סאונד! 
        אצלנו תמצאו מגוון עצום של כלי נגינה – גיטרות, פסנתרים, כינורות, תופים, חלילים, נבלים, ועוד, 
        לצד מערכות הגברה מקצועיות לצרכים מגוונים. 
        החנות שלנו נוסדה מתוך אהבה עמוקה למוזיקה ורצון להנגיש את התחום לכל מי שחולם לנגן וליצור.
        אנו מאמינים שמוזיקה היא לא רק תחביב, אלא דרך חיים שמחברת בין אנשים ומעוררת השראה בעולם כולו.
        <br /><br />
        כל מוצר שנבחר לחנות שלנו נבדק בקפידה, תוך שימת דגש על איכות גבוהה וחדשנות טכנולוגית. 
        אנו מייצגים מותגים מובילים מהעולם שמוכרים בזכות אמינותם וביצועיהם המרשימים. 
        אם אתם מחפשים גיטרה עם צליל ייחודי, פסנתר למתחילים או מערכות הגברה מקצועיות להופעות – אצלנו תמצאו את הכל.
        <br /><br />
        צוות החנות שלנו מורכב מנגנים ומוזיקאים בעלי תשוקה ואהבה למוזיקה, 
        שמבינים היטב את הצרכים של כל לקוח. אנו כאן כדי ללוות אתכם מהשלב הראשון של החיפוש ועד לבחירת הכלי המושלם עבורכם, 
        עם ייעוץ אישי ומקצועי שיעזור לכם להגיע לבחירה הנכונה.
        <br /><br />
        אנו מאמינים שחוויית רכישה צריכה להיות הרבה מעבר למכירה בלבד. 
        לכן יצרנו סביבה חמה ומזמינה, שבה תוכלו לנסות את הכלים, 
        לשאול שאלות וליהנות משירות מותאם אישית. 
        מעבר לכך, אנו מארגנים סדנאות, הופעות חיות ואירועים חינוכיים, 
        כדי להעשיר את עולם המוזיקה של לקוחותינו ולחזק את הקשר הקהילתי.
        <br /><br />
        בין אם אתם נגנים מנוסים או רק בתחילת הדרך המוזיקלית שלכם, 
        אנו מזמינים אתכם להצטרף למשפחה הגדולה של לקוחותינו. 
        אצלנו תמצאו השראה, כלים איכותיים, ותמיכה מקצועית לכל צעד במסע המוזיקלי שלכם.
        החזון שלנו הוא לעודד יצירה, להעניק חוויות בלתי נשכחות, ולהיות הבית של המוזיקאים בישראל.
    </p>
</div>
                <div style={imageSectionStyle}>
                    
                    <img src="/img/shop.jpg" alt="כלי נגינה" style={imgStyle} />
                </div>
            </div>
       
            </>
   
}

export default About;
